{"data":{"site":{"siteMetadata":{"title":"JλO","author":"Jean-Louis Leysens"}},"markdownRemark":{"id":"c8b41213-0e32-5d96-9001-de15cd4d56f7","excerpt":"I have recently quite enjoyed the use of TODO comments (or TODOs). On one\nhand there is something really off-putting about having TODOs littered all\nover your…","html":"<p>I have recently quite enjoyed the use of TODO comments (or TODOs). On one\nhand there is something really off-putting about having TODOs littered all\nover your code base. Like threads of thought that did not have time to fully\ndevelop and are now dangling appendages of what could have been if only\nsomeone had finished the job at time, but for whatever reason could not.</p>\n<p>At their worst TODOs are things that I would avoid placing in code. Your\ncollaborators (or your future self) will come across them lacking the context\nof your train of thought. In this way a TODO comment can really feel like a\ncompromise that was made without a clear rationale and so appear like work\nuncompleted. Usually a standard comment is more appropriate and should be\nused liberally in cases where code may be in a state that is hard for new\nreaders to reason about.</p>\n<p>At their best TODOs are indicators of future work <em>placed right in the code itself</em>. It could\nbe a brief description of a feature or a simple indicator that standard protocol\nwas skipped for the sake of brevity — in my case writing front-end code may call\nfor the addition of high quality copy that end users will read, but may not be\nworth spending time on <em>now</em> because this version of your contribution (usually in\nthe form of a PR) is not finalized.</p>\n<p>I would like to propose that a TODO can be most effective not when the yet-to-be-built\nthing is ill-conceived, but rather it is precisely at its most useful when others\ncan read the code, encounter the TODO and exclaim “YES! <em>That</em> would be a great\nnext iteration”.</p>","frontmatter":{"title":"TODO","date":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"code","slug":"/code/todo/","previous":{"fields":{"slug":"/code/either/"},"frontmatter":{"title":"Errors and Either"}},"next":null}}