{"data":{"site":{"siteMetadata":{"title":"JλO","author":"Jean-Louis Leysens"}},"markdownRemark":{"id":"5552df3a-0001-57b1-9154-5cf6345b77bd","excerpt":"I won’t pretend I am the biggest The Dillinger Escape Plan (TDEP) fan in the\nworld. I have probably listened to roughly 80% of their discography. But I\nwas…","html":"<p>I won’t pretend I am the biggest The Dillinger Escape Plan (TDEP) fan in the\nworld. I have probably listened to roughly 80% of their discography. But I\nwas enraptured by their unique style that sought to undo many of the comforts\nwe have in conventional song-writing and musicianship.</p>\n<p>Some years ago I was playing a video game called Bioshock in which you — the\nprotagonist — crash land in the middle of the ocean in the opening chapter.\nThe cause of your misfortune is not disclosed. The still floating, burning\nwreckage that was your plane is slowly sinking and so you are encourage to\nalight. Into the waters. Fortunately a tower in the middle of the ocean is\nwithin swimming distance, it is your only hope for survival. After\ndragging your apparently capable self out of the ocean waters your enter the\ntower. From here things get pretty crazy. An elevator takes you to an\nundersea city where the brightest scientific minds have created a safe haven\nfor pushing the limits of what humanity can achieve. Unfettered by\nscruples they have pushed all fronts of scientific advancement. People can\nrun faster, they are much stronger and they can shoot fireballs from their\nfinger-tips (because why not!?). But not all is well in this undersea world\ncalled Rapture. Human greed and narcissism have won out. Self-improvement and\nself-glorification have led some in Rapture to aspire to totalitarian\nheights. Cue the track “When Acting As A Wave” from TDEP’s “Ire Works”.</p>\n<p>Delving deeper still into the mysteries of Rapture I continued to listen to\nTDEP. A better musical match for the peculiar horrors in this underworld is a\ntall order. Like the denizens of rapture, TDEP is truly manic and\nschizophrenic. Their track “Lurch”, a song about a stalker reflecting on the\nobject of his desire is as creepy as it sounds - “…your picture in my pocket I’m obsessed\nwith you”.</p>\n<p>There are songs that are truly moments of quiet clarity and none so more than, to my mind,\nthan their track the title track from “Dissociation”. Tracks like these invite\na more reflective and personal mode, albeit remaining true to the off-kilter sound\nTDEP work tirelessly to reproduce. Through a combination of two drum tracks coming\nin and out of the left and right sides of the stereo image I cannot think of a better\ndepiction of being in two minds in music. Two narratives, not intended to co-exist\nbut somehow co-existing regardless.</p>","frontmatter":{"title":"On The Dillinger Escape Plan","date":"May 19, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"music","slug":"/music/on-the-dillinger-escape-plan/","previous":null,"next":{"fields":{"slug":"/music/the-chariot/"},"frontmatter":{"title":"On The Chariot"}}}}