{"data":{"site":{"siteMetadata":{"title":"JλO","author":"Jean-Louis Leysens"}},"markdownRemark":{"id":"ede28958-22e8-5ab7-b840-08d6894bd3da","excerpt":"The Last of Us (TLOU) part II was released on June 19th 2020. The studio\nthat masterminded its creation, Naughty Dog, has dedicated an enormous amount\nof…","html":"<p>The Last of Us (TLOU) part II was released on June 19th 2020. The studio\nthat masterminded its creation, Naughty Dog, has dedicated an enormous amount\nof resources to creating this game. And I think what they have created reaches\nbeyond the scope of video game and deep into the realm of art and story telling.\nI would like to unpack this further, but as a preface I would like to state\nfrom the outset that I did not like a lot of the decisions that were made for this\ngame. I did not like it, but I still marvel at it.</p>\n<p>Before going any further, please note that <strong>this discussion contains many spoilers</strong>.</p>\n<p>TLOU part II picks up some years after where the first game left off. With\nEllie and Joel still in Jackson. It seems their cross-country\ntravelling has settled into a routine much closer to the normality of the\nbefore-times. Albeit with the occasional patrol duty that has them fighting off\nany infected that threaten to encroach upon their haven. Children play in the\nstreets, warm fires are burning indoors and new relationships are burgeoning.\nIt is clear from the outset, however, that not all is well between Ellie and\nJoel. At this point only you know what Joel did back in Salt\nLake. This fact, one could imagine, has been eating away at Ellie’s trust for\nJoel over a number of years. You know she suspects Joels account to not be\ntruthful.</p>\n<p>For me, and for many others I would argue, the closeness and significance of\nthe relationship between Ellie and Joel becomes the linchpin and central\ndriving force for the decisions made in the first game. The first game ends\non a particularly melancholic note in this regard. Joel lies to Ellie about\nthe reason they left Salt Lake and that her gift of immunity could not be\nconverted into the gift of a vaccine for many. The weight of this can only\nbe known if you have played the first game, and I would strongly encourage\nnewcomers to do so.</p>\n<p>Joel is a cowboy. In the most classic and archetypal sense. He is a man of few\nwords and a countenance of impenetrabililty. Think back to the first game when\nJoel would brutally slaughter infected and adversarial non-infected alike only\nto offer a closing remark: “That’s that”. Pushing on into new hellish experiences\nof seemingly relentless violence and hopelessness. Hopelessness. Remember that word.\nIn the first game, the theme of hopelessness is central but Joel and Ellie represent\na defiance against it. Not one that is incorruptible. But one that is human and\ntenacious. Joel holds on to Ellie and Ellie holds on to the hope for a new future.\nThat equation is woven throughout the first game. But what happens when the new\nfuture demands a sacrifice Joel cannot make? He claims back his reason to live. Joel\nknows above all else what is required for his survival, and through the course of the\nfirst game that becomes Ellie - his reincarnated daughter.</p>\n<p>Fast-forward to the TLOU part II and we are confronted with the reality that\nJoel’s past decisions are not without consequence. He claimed back Ellie but it\ncame at a great cost; a vaccine for the virus that has maimed humanity -\nlimping onward into a pointless struggle of zero-sum games between tribal\nfactions.  A truly fractured civilisation. Another cost; Ellie’s primary source\nof significance. It is clear that Ellie wrestles with this loss and blames Joel\nfor this openly. There is one scene in the later chapters of the second game\nthat displays as much. The ultimate cost is Joel’s very life. He crossed too\nmany lines in his violent, bloody rescue mission. Joel murders the only person\nthat could create a vaccine to restore humanity and in the process creates a\nmortal enemy.</p>\n<p>The cost of Ellie’s significance is more nuanced of course. For Ellie, Joel\npartially fills the void of insignificance.\nHe writes her a song; “If I ever were to lose you, I\nwould surely lose myself…“. Ellie echoes this song throughout the course of the\nsecond game in moments of reflection. Playing on the guitar that Joel made for her.\nThe guitar represents Joel and the hope that the Fireflies represented in the\nfirst game. The song expresses the significance Joel embued onto her, something\nshe holds on to. But it also represnts the anger, hate and distrust of Joel’s\nselfish short-sightedness. Ellie knows that the significance she gets from Joel\npales in comparison to the significance her life could have had if the events\nof Salt Lake were different. Joel admits that given a second chance to go to\nSalt Lake, he would do the same thing. Let that sink in. Joel is unchanging.\nJoel is conservation of what little you still have. Joel is survival at any\ncost.</p>\n<p>The second game, for me, is an excellent portrayal of Ellie’s process of\ndealing with Joel’s death and is by far the richest component of the story. The\nrest of the story I found uncompelling. The rest being roughly 60% of the game.\nThis is really unfortunate. I would recommend watching <a href=\"https://www.youtube.com/watch?v=GB20A8CitRU&#x26;\">SkillUp’s\nreview</a> as a supplement to this\nreview because he has done an excellent job alluding to the wake TLOU leaves\nTLOU part II in. The core problem for me is the game starts you down a path of\nhopelessness and concludes on a net loss. Many people die and none are richer\nfor any actions the central characters make in the game. This coupled with the\n<em>very long</em> exposition into the life of Abby. The daughter of the doctor who\nJoel kills in the first game<sup>1</sup>.</p>\n<p>Abby’s tie to Joel and Ellie is on the basis of her revenge against Joel. This\ncobbled together revenge story launches Ellie into her own counter-revenge\nstory. A large part of her remaining source of significance, Joel, is brutally\nkilled in front of her. Ellie is on a war path and drags loved ones around her\ninto a spiralling sequence of bad-to-worse events.  The whole first section of\nthe game runs against the grain of who you come to know Ellie is. This is\nproblematic.</p>\n<h3>Notes</h3>\n<ol>\n<li>I am not going to spend too much time discussing a core tension in TLOU;\nviolence and guilt and how they relate to the core gameplay mechanics and\nnarrative. The game has you killing people constantly but expects you to\nfeel guilt when your character murders another important character. For this\nI can suspend my disbelief and treat enemies as puzzles, nothing more. Even though\nthe game tries to trick you into thinking they are also people by giving them names 🙄.</li>\n</ol>","frontmatter":{"title":"The Last of Us & The Last of Us part II","date":"June 28, 2020"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"video-games","slug":"/video-games/tlou-part-ii/","previous":null,"next":null}}