{"data":{"site":{"siteMetadata":{"title":"JλO","author":"Jean-Louis Leysens"}},"markdownRemark":{"id":"5552df3a-0001-57b1-9154-5cf6345b77bd","excerpt":"The Dillinger Escape Plan (TDEP) are a special group, and I would like to\ntalk about why. I have probably listened to roughly 80% of their discography\nand I was…","html":"<p>The Dillinger Escape Plan (TDEP) are a special group, and I would like to\ntalk about why. I have probably listened to roughly 80% of their discography\nand I was enraptured by their unique style that sought to undo many of the\ncomforts we have in conventional song-writing and musicianship.</p>\n<p>Some years ago I was playing a video game called Bioshock in which you — the\nprotagonist — crash land in the middle of the ocean in the opening chapter.\nThe cause of your misfortune is not disclosed. The still floating, burning\nwreckage that was your plane is slowly sinking and so you are encouraged to\nalight. Into the nebulous ocean waters.</p>\n<p>Fortunately a tower in the middle of the ocean is within swimming distance,\nit is your only hope for survival. After dragging your apparently capable\nself out of the ocean waters you enter the base of the tower. From here\nthings get pretty crazy. An elevator takes you to an undersea city where the\nbrightest scientific minds have created a safe haven for pushing the limits\nof what humanity can achieve. Unfettered by scruples, all fronts of scientific\nadvancement have been pushed to dizzying heights. People can run faster, they\nare much stronger and they can shoot fire from their finger-tips\n(because why not!?). Sub-human creatures act as enforcers of an unspoken law.\nAll of this comes at great cost, of course.</p>\n<p>Greed and narcissism have won out over nobler goals. Self-improvement and\nself-glorification have led some in Rapture to set totalitarian goals leaving\nmany scraping the bottom of the barrel. Medicaments that augment abilities\nare also highly addictive and so insanity has taken hold over most of the\npopulace, their dignity stripped as well as their pockets. This is where you\nenter.</p>\n<p>Cue the track “Fix your face” from TDEPs “Ire Works”.</p>\n<p>Delving deeper still into the mysteries of Rapture I continued to listen to\nTDEP. A better musical match for the peculiar horrors in this underworld is a\ntall order. Like the denizens of rapture, TDEP is truly manic and\nschizophrenic. Their track “Lurch”, a song about a stalker reflecting on the\nobject of his desire is as creepy as it is frantic - “…your picture in my pocket I’m obsessed\nwith you”.</p>\n<p>Amidst this swirling chaos there are songs that are truly moments of quiet\nclarity and none so more than, to my mind, than their track the title track\nfrom “Dissociation”. Tracks like these invite a more reflective and personal\nmode, albeit remaining true to the off-kilter sound TDEP work tirelessly to\nreproduce. Through a combination of two drum tracks coming in and out of the\nleft and right sides of the stereo image I cannot think of a better depiction\nof being in two minds in music. Two narratives, not intended to co-exist\nbut somehow co-existing regardless.</p>\n<p>From a sound perspective, TDEP have opted for more barky, rock-sounding\nguitars - with blazingly high gain to be sure. They are not a <em>metal band</em> but\nthey are also not quite, only a <em>hardcore band</em>. They have created a specific\nsound.</p>\n<p>I leave you with a final recommendation to listen to the track “When Good\nDogs Do Bad Things” from “irony is a dead scene”. It is one of my personal\nfavorites and an uncharacteristically long song for TDEP. It showcases their\ndynamism while staying true to the narrative they would go on to develop.</p>","frontmatter":{"title":"On The Dillinger Escape Plan","date":"May 19, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"music","slug":"/music/on-the-dillinger-escape-plan/","previous":null,"next":{"fields":{"slug":"/music/the-chariot/"},"frontmatter":{"title":"On The Chariot"}}}}